Revit 2024 API
TextNode.IsUnderlined Property
 Indicates whether the default formatting is set to underlined text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsUnderlined { get; }
Visual Basic
Public ReadOnly Property IsUnderlined As Boolean
	Get
Visual C++
public:
property bool IsUnderlined {
	bool get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace